# ── Taps ──────────────────────────────────────────────────────────────────────
tap "koyeb/tap"
tap "schpet/tap"

# ── Formulae ──────────────────────────────────────────────────────────────────
brew "bat"
brew "buildkit"
brew "cocoapods"
brew "deno"
brew "direnv"
brew "dive"
brew "docker"
brew "doctl"
brew "duckdb"
brew "eza"
brew "exiftool"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-crypt"
brew "htop"
brew "koyeb/tap/koyeb"
brew "mise"
brew "opencode"
brew "openjdk"
brew "pipx"
brew "postgresql@14"
brew "python@3.13"
brew "python@3.14"
brew "redis"
brew "schpet/tap/linear"
brew "starship"
brew "stow"
brew "terminal-notifier"
brew "tree"
brew "unar"
brew "wrangler"
brew "yt-dlp"
brew "zoxide"

# ── Casks ─────────────────────────────────────────────────────────────────────
cask "1password"
cask "brave-browser"
cask "bruno"
cask "claude"
cask "cloudflare-warp"
cask "figma"
cask "google-chrome"
cask "iterm2"
cask "linear"
cask "macfuse"
cask "ngrok"
cask "notion"
cask "onyx"
cask "orbstack"
cask "slack"
cask "swiftbar"
cask "vlc"
cask "windsurf"

# ── VS Code extensions ────────────────────────────────────────────────────────
vscode "biomejs.biome"
